{"config": {"input_layers": [["Sequence", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"sparse": false, "name": "Sequence", "dtype": "float32", "batch_input_shape": [null, 51]}, "name": "Sequence", "class_name": "InputLayer"}, {"inbound_nodes": [[["Sequence", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "embeddings_regularizer": null, "mask_zero": true, "name": "embedding_1", "batch_input_shape": [null, 51], "input_dim": 21, "embeddings_constraint": null, "activity_regularizer": null, "output_dim": 10, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "input_length": 51}, "name": "embedding_1", "class_name": "Embedding"}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"trainable": true, "layer": {"config": {"return_sequences": false, "activation": "softsign", "kernel_regularizer": null, "unroll": true, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_regularizer": null, "trainable": true, "return_state": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "go_backwards": false, "kernel_constraint": null, "implementation": 1, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "recurrent_constraint": null, "dropout": 0.5, "recurrent_regularizer": null, "activity_regularizer": null, "unit_forget_bias": true, "use_bias": true, "units": 20, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "LSTM"}, "merge_mode": "concat", "name": "bidirectional_1"}, "name": "bidirectional_1", "class_name": "Bidirectional"}, {"inbound_nodes": [[["bidirectional_1", 0, 0, {}]]], "config": {"trainable": true, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "name": "batch_normalization_1", "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}, "name": "batch_normalization_1", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"kernel_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "final_predict", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "units": 1}, "name": "final_predict", "class_name": "Dense"}], "output_layers": [["final_predict", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}